---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.MajorSegment
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.MajorSegment

Identifies one segment of the rebar shape that maintains its general position in rotation and auto-expansion behaviors.